Revit 2027 API
FabricationOptionDefinition Properties
The FabricationOptionDefinition type exposes the following members.
Properties
Name | Description
IsModifiable |  Checks if the fabrication option is modifiable by user.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  Fabrication option name.
Top
See Also
Reference
FabricationOptionDefinition Class
Autodesk.Revit.DB Namespace